Revit 2023 API
ExportResolution Enumeration
 An enumerated type listing possible options to control the tessellation quality.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2023
Since: 2023
Syntax
C#
public enum ExportResolution
Visual Basic
Public Enumeration ExportResolution
Visual C++
public enum class ExportResolution
Members
Member name | Description
Custom |  STL and OBJ exporting with custom resolution (all possible STL/OBJ tessellation parameters have default values).
Fine |  STL and OBJ exporting with fine resolution.
Medium |  STL and OBJ exporting with medium resolution.
Coarse |  STL and OBJ exporting with coarse resolution.
See Also
Autodesk.Revit.DB Namespace